* Backlog 1

| number | description                                                                                                                                              | effort | priority | cost |
|--------+----------------------------------------------------------------------------------------------------------------------------------------------------------+--------+----------+------|
|      1 | En tant que visiteur, je souhaite m’enregistrer comme laboratoire, afin de gérer mes ateliers                                                            |     13 |          |      |
|      2 | En tant que laboratoire, je souhaite ajouter un nouvel atelier, afin de permettre aux enseignants de s’y inscrire.                                       |      8 |          |      |
|      3 | En tant que laboratoire, je souhaite lister mes ateliers, afin de les modifier ou les supprimer.                                                         |      8 |          |      |
|      4 | En tant que laboratoire, je souhaite pouvoir visualiser un de mes ateliers, afin de voir ce que les enseignants voient.                                  |      5 |          |      |
|      5 | En tant que laboratoire, je souhaite pouvoir me déconnecter.                                                                                             |      1 |          |      |
|      6 | En tant que laboratoire, je souhaite activer/ désactiver un ateliers, afin de permettre aux enseignants de s’y inscrire ou de ne pas s’y inscrire.       |      2 |          |      |
|      7 | En tant que laboratoire, je souhaite exporter un PDF de mes ateliers, afin de faire ma propre promotion.                                                 |      5 |          |      |
|      8 | En tant que laboratoire, je souhaite que mes ateliers soient sauvegardés dans la base de données, afin de pouvoir les retrouver si le serveur redémarre. |     13 |          |      |
|      9 | En tant que laboratoire, je souhaite que l’interface soit agréable à utiliser, afin de faciliter l’édition des ateliers.                                 |      5 |          |      |
|     10 | En tant que laboratoire, je souhaite que l’interface soit réalisée avec Bootstrap, afin de pouvoir l’utiliser sur des terminaux mobiles                  |      3 |          |      |

** questions
*** question 1
    US10
*** question 2
    US1 mais elle est utile pour que les ateliers soient en acces protege.
*** question 3
    Cet US pourrait se diviser en trois parties: lister, modifier et supprimer.
*** question 4
    Nous avons commencer le backlog en commençant par le US2 et 3, car ce sont les deux principaux et les plus liés. En effet, sans le US2, le US3 et US4 n'as pas lieu d'exister.
    Le US4 coûtent moins cher car il demande moins de travail.

** task list for each user story

*** US#1 US#5
    | task                                        | cost M/D | nb |
    |---------------------------------------------+----------+----|
    | database coding                             |      0.5 |  1 |
    | user manager coding (acess privileges)      |        2 |  2 |
    | coding of the loging/logoff system          |        1 |  3 |
    | REST API coding                             |        1 |  4 |
    | coding of the view for the registering      |        1 |  5 |
    | coding of the controler for the registering |        1 |  6 |
    | codign of the model for the registering     |        1 |  7 |
    | test the registering                        |        1 |  8 |
    | test the REST API                           |      0.5 |  9 |
    | test the login and logoff                   |      0.5 | 10 |
    |---------------------------------------------+----------+----|
    | TOTAL                                       |      9.5 |    |
#+TBLFM: @12$2=vsum(@2$2..@11$2)


*** US#2 US#3 US#4 US#6

    | task                                         | cost M/D | nb |
    |----------------------------------------------+----------+----|
    | database coding                              |      0.5 |  1 |
    | REST API coding                              |        1 |  3 |
    | coding of the view for the atelier           |        1 | 11 |
    | coding of the controler for the atelier      |        1 | 12 |
    | codign of the model for the atelier          |        1 | 13 |
    | coding of the view for the atelier list      |        1 | 14 |
    | coding of the controler for the atelier list |        1 | 15 |
    | codign of the model for the atelier list     |        1 | 16 |
    | test the atelier list                        |        1 | 17 |
    | test the atelir visualisation                |        1 | 18 |
    | test the REST API                            |      0.5 |  9 |
    |----------------------------------------------+----------+----|
    | TOTAL                                        |      10. |    |
#+TBLFM: @13$2=vsum(@2$2..@12$2)

*** US#7


    | task                       | cost M/D | nb |
    |----------------------------+----------+----|
    | REST API coding            |      0.5 |  3 |
    | coding of the pdf exporter |      1.5 | 19 |
    | test the pdf builder       |        1 | 20 |
    |----------------------------+----------+----|
    | TOTAL                      |       3. |    |
#+TBLFM: @5$2=vsum(@2$2..@4$2)

*** US#8 US#9
    implicity on all the other user story

*** US#10
    the website will be responsive but that doesn't imply that bootstrap is the best solution for that

*** dependence

|    | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 |   | 10 | 11 | 12 | 13 | 14 | 15 | 16 | 17 | 18 |   | 19 | 20 |
|----+---+---+---+---+---+---+---+---+---+---+----+----+----+----+----+----+----+----+----+---+----+----|
|  1 |   |   |   |   |   |   |   |   |   |   |    |    |    |    |    |    |    |    |    |   |    |    |
|  2 | x |   |   |   |   |   |   |   |   |   |    |    |    |    |    |    |    |    |    |   |    |    |
|  3 | x | x |   | x |   |   |   |   |   |   |    |    |    |    |    |    |    |    |    |   |    |    |
|  4 | x |   |   |   |   |   |   |   |   |   |    |    |    |    |    |    |    |    |    |   |    |    |
|  5 |   |   |   |   |   | x |   |   |   |   |    |    |    |    |    |    |    |    |    |   |    |    |
|  6 |   |   |   |   |   |   | x |   |   |   |    |    |    |    |    |    |    |    |    |   |    |    |
|  7 | x |   |   | x |   |   |   |   |   |   |    |    |    |    |    |    |    |    |    |   |    |    |
|  8 |   |   |   |   | x | x | x |   |   |   |    |    |    |    |    |    |    |    |    |   |    |    |
|  9 |   |   |   | x |   |   |   |   |   |   |    |    |    |    |    |    |    |    |    |   |    |    |
| 10 |   |   | x |   |   |   |   |   |   |   |    |    |    |    |    |    |    |    |    |   |    |    |
|    |   |   |   |   |   |   |   |   |   |   |    |    |    |    |    |    |    |    |    |   |    |    |
| 11 |   |   |   |   |   |   |   |   |   |   |    |    | x  |    |    |    |    |    |    |   |    |    |
| 12 |   |   |   |   |   |   |   |   |   |   |    |    |    | x  |    |    |    |    |    |   |    |    |
| 13 | x |   | x |   |   |   |   |   |   |   |    |    |    |    |    |    |    |    |    |   |    |    |
| 14 |   |   |   |   |   |   |   |   |   |   |    |    |    |    |    | x  |    |    |    |   |    |    |
| 15 |   |   |   |   |   |   |   |   |   |   |    |    |    |    |    |    | x  |    |    |   |    |    |
| 16 | x |   | x |   |   |   |   |   |   |   |    |    |    |    |    |    |    |    |    |   |    |    |
| 17 |   |   |   |   |   |   |   |   |   |   |    |  x | x  | x  |    |    |    |    |    |   |    |    |
| 18 |   |   |   |   |   |   |   |   |   |   |    |    |    |    |  x | x  | x  |    |    |   |    |    |
|    |   |   |   |   |   |   |   |   |   |   |    |    |    |    |    |    |    |    |    |   |    |    |
| 19 |   |   | x |   |   |   |   |   |   |   |    |    |    |    |    |    |    |    |    |   |    |    |
| 20 |   |   |   |   |   |   |   |   |   |   |    |    |    |    |    |    |    |    |    |   |  x |    | 

*** planning

|      | 0.5 | 1 | 1.5 | 2 | 2.5 | 3 | 3.5 |  4 | 4.5 |  5 | 5.5 |  6 | 6.5 |  7 | 7.5 |  8 | 8.5 |
|------+-----+---+-----+---+-----+---+-----+----+-----+----+-----+----+-----+----+-----+----+-----|
| dev1 |   1 | 2 |   2 | 2 |   2 | 3 |   3 | 16 |  16 | 15 |  15 | 14 |  14 | 18 |  18 |    |     |
| dev2 |     | 4 |   4 | 7 |   7 | 6 |   6 | 13 |  13 | 12 |  12 | 11 |  11 | 17 |  17 | 10 |     |
| dev3 |     |   |     | 9 |     |   |     |  5 |   5 |  8 |   8 | 19 |  19 | 19 |  20 | 20 |     |

*** planning avec absence

le dev1 tombe malade le jour 4

|      | 0.5 | 1 | 1.5 | 2 | 2.5 | 3 | 3.5 |  4 | 4.5 |  5 | 5.5 |  6 | 6.5 |  7 | 7.5 |  8 | 8.5 |  9 | 
|------+-----+---+-----+---+-----+---+-----+----+-----+----+-----+----+-----+----+-----+----+-----+----|
| dev1 |   1 | 2 |   2 | 2 |   2 | 3 |   3 |  x |   x |  x |   x | 16 |  16 | 15 |  15 | 14 |  14 |    |
| dev2 |     | 4 |   4 | 7 |   7 | 6 |   6 | 13 |  13 | 12 |  12 | 11 |  11 | 17 |  17 | 10 |     |    |
| dev3 |     |   |     | 9 |     |   |     |  5 |   5 |  8 |   8 | 19 |  19 | 19 |  20 | 20 |  18 | 18 |

le dev1 tombe malade le jour 1

|      | 0.5 | 1 | 1.5 | 2 | 2.5 | 3 | 3.5 |  4 | 4.5 |  5 | 5.5 |  6 | 6.5 |  7 | 7.5 |  8 |
|------+-----+---+-----+---+-----+---+-----+----+-----+----+-----+----+-----+----+-----+----|
| dev1 |   1 | x |   x | x |   x | 9 |     | 16 |  16 | 15 |  15 | 14 |  14 | 18 |  18 |    |
| dev2 |     | 4 |   4 | 7 |   7 | 6 |   6 | 13 |  13 | 12 |  12 | 11 |  11 | 17 |  17 | 10 |
| dev3 |     | 2 |   2 | 2 |   2 | 3 |   3 |  5 |   5 |  8 |   8 | 19 |  19 | 19 |  20 | 20 |
|      |     |   |     |   |     |   |     |    |     |    |     |    |     |    |     |    |

* backlog phase 2

| number | description                                                                                                                                             | effort | priority | cost |
|--------+---------------------------------------------------------------------------------------------------------------------------------------------------------+--------+----------+------|
|      1 | En tant que visiteur, je souhaite m’enregistrer comme enseignant, afin de pouvoir s'inscrire a des ateliers.                                            |    13  |          |      |
|      2 | En tant que enseignant, je souhaite avoir un récapitulatif des mes inscriptions, afin d'y avoir des informations de contact, d'horaire et de trajet.    |    3   |          |      |
|      3 | En tant que enseignant, je souhaite avoir accès à une liste des fiches d'ateliers enregistrés.                                                          |    8   |          |      |
|      4 | En tant que enseignant, je souhaite voir la liste des fiches par laboratoire et par thématique afin de cibler ma demande.                               |    5   |          |      |
|      5 | En tant que enseignant, je souhaite avoir accès en temps réel aux disponiblités des ateliers afin de pouvoir m'inscrire aux ateliers.                   |    13  |          |      |
|      6 | En tant que enseignant, je souhaite avoir une carte géographique localisant les ateliers afin de savoir comment m'y rendre.                             |    21  |          |      |
|      7 | En tant que enseignant, je souhaite pouvoir être averti d'un refus ou d'une validation d'une inscription à un atelier.                                  |    3   |          |      |


** task list for each user story

*** US#1


   

* backlog phase 3

Utilisateur = Enseignant ET laboratoire.

| number | description                                                                                                                                                                            | effort | priority | cost |
|--------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------+----------+------|
|      2 | En tant que laboratoire, je souhaite être capable de créer une carte géographique.                                                                                                     |  21    |          |      |
|      3 | En tant que enseignant, je souhaite avoir accès à des cartes graphiques afin de pouvoir construire et visualiser mes parcours plus facilement.                                         |  21    |          |      |
|      4 | En tant que enseignant, je souhaite avoir une visualisation bien définie afin de différencier chaque discipline.                                                                       |  13    |          |      |
|      5 | En tant que enseignant, je souhaite avoir un récapitulatif des ateliers avec des informations d'horaires, de contact et d'itinéraire.                                                  |  5     |          |      |
|      6 | En tant que laboratoire, je souhaite avoir un récapitulatif des ateliers avec des informations d'heure, de date, de niveau de la classe de l'enseignant et le nom de l'établissement.  |  5     |          |      |
